---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeIterator.HasCurrent
source: html/4d05ba5f-a4f5-d262-784f-5489729012f9.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeIterator.HasCurrent Method

Identifies if the iterator has a current item.

## Syntax (C#)
```csharp
public bool HasCurrent()
```

## Returns
True if there is a current item.

## Remarks
There is no current item if the iterator has not started yet or has been done.